{
    "en": {
        "head.title": "mTranslator: AI-driven intelligent translation",
        "meta.description": "mTranslator leverages advanced LLMs for one‑click translations of web pages, subtitles, inputs, and documents. Its context‑aware AI delivers precise, natural results for seamless global communication.",
        "twitter.image.alt": "mTranslator logo in white on a purple-to-pink gradient",
        "nav.pricing": "Pricing",
        "nav.download": "Download",
        "nav.resource": "Resources",
        "register": "Sign in",
        "banner.slogan": "The World, YOUR WORDS",
        "banner.text": "AI-driven intelligent translation <br> supporting web-page translation, subtitle translation, <br> input translation, and text translation.",
        "banner.button": "Try for Free",
        "web.p": "Install the mTranslator browser add-on and translate entire web pages with just one click. Whether it's foreign language news, technical documentation, or multilingual e-commerce pages, the plugin automatically optimizes the translation based on page content and your needs, and supports a bilingual mode to help you quickly grasp the information.",
        "web.h2": "Translate Major Websites with One Click",
        "web.button": "Get Started",
        "subtitle.p": "Use the mTranslator browser plug-in to watch videos with real-time subtitle translation. Whether for learning, entertainment, or international communication, overcoming language barriers has never been easier.",
        "subtitle.button": "Try for Free",
        "input.p": "No need to switch apps or take extra steps. Just type in a web input box or instant chat, then press the space bar three times in a row to quickly translate the content into the target language.",
        "text.p": "mTranslator provides accurate, context-optimized text translation services. Whether it's an academic paper, a business document, or a conversation, mLLM selects the most suitable language model based on text type and context to ensure translation accuracy and fluency.",
        "text.button": "Get Started",
        "tool.screenshot.title": "Screenshot Translation",
        "tool.screenshot.p": "Select the most suitable language model to ensure accurate and fluent translation results.",
        "tool.pdf.title": "PDF Translation",
        "tool.pdf.p": "For text-based PDF documents (such as reports and academic papers), mTranslator can accurately extract and translate the text.",
        "tool.docx.title": "DOCX Translation",
        "tool.docx.p": "Translate entire documents at once without manual copy-pasting, saving you time—especially for lengthy articles, reports, or books.",
        "tool.epub.title": "EPUB Translation",
        "tool.epub.p": "Efficiently translate cross-language digital publications to offer a better reading experience for users worldwide.",
        "mLLM.intro1": "mLLM (Multi-Source Language Learning Model) is an intelligent translation engine developed by the mTranslator team.",
        "mLLM.intro2": "It aggregates multiple leading AI translation models and dynamically selects the best one based on language, text type, and usage scenario. The system continuously evaluates AI models’ comprehension, translation quality, and adaptability to ensure optimal selection.",
        "mLLM.intro3": "As AI evolves rapidly, models are frequently updated and their performance changes. mLLM tracks the latest advancements in real-time, optimizing model selection so users get the best translation experience without manual engine switching.",
        "privacy.title": "Privacy Statement",
        "privacy.p1": "The mTranslator team takes user privacy and data security very seriously.",
        "privacy.p2": "During translation services, we may use translation data to optimize the performance of the mLLM engine while ensuring anonymity.",
        "privacy.p3": "However, we will never record, store, or analyze any personal data that can identify you.",
        "privacy.p4": "Your personal information is always secure and protected, and we promise not to use it for other purposes or share it with third parties. ",
        "privacy.p5": "Our privacy measures ensure your data is strictly safeguarded under all circumstances.",
        "footer.terms": "Terms & Conditions",
        "footer.privacy": "Privacy Policy",
        "ul_title1": "Supports over 30 languages worldwide, with continuous expansion：",
        "ul_title2": "Smart Understanding, Precise and Fluent：",
        "ul_title3": "AI-Optimized Engine, Always Delivering the Best Translation：",
        "li_text1": "The mLLM translation engine is continuously iterated and optimized, updating language support in real time to facilitate smoother cross-language communication.",
        "li_text2": "Not limited to sentence-by-sentence translation, mTranslator employs full-text analysis and contextual understanding to generate translations that sound more natural and align with native expression habits.",
        "li_text3": "By monitoring AI translation performance in real time and intelligently matching the optimal model, it dynamically optimizes translation quality across languages to ensure consistently precise and outstanding results.",
        "disclaimer_title": "Disclaimer:",
        "disclaimer_NASA": "The NASA website screenshots displayed on this page are for translation demonstration purposes only. This website is not affiliated with or endorsed by NASA.",
        "title404": "Page Not Found",
        "message404": "Sorry, we cannot find the page you are looking for.",
        "button404": "Back to Home"
    },
    "de": {
        "head.title": "mTranslator: KI-gesteuerte intelligente Übersetzung",
        "meta.description": "mTranslator nutzt fortschrittliche LLMs für Ein‑Klick‑Übersetzung von Webseiten, Untertiteln, Eingaben und Dokumenten. Kontextbewusste KI liefert präzise, natürliche Ergebnisse für globale Kommunikation.",
        "twitter.image.alt": "mTranslator-Logo in Weiß auf lila-zu-pink Farbverlauf-Hintergrund",
        "nav.pricing": "Preise",
        "nav.download": "Download",
        "nav.resource": "Ressourcen",
        "register": "Anmelden",
        "banner.slogan": "The World, YOUR WORDS",
        "banner.text": "KI-gesteuerte intelligente Übersetzung <br> unterstützt Webseitenübersetzung, Untertitelübersetzung, <br> Eingabeübersetzung und Textübersetzung.",
        "banner.button": "Kostenlos testen",
        "web.p": "Installieren Sie das mTranslator-Browser-Addon und übersetzen Sie ganze Webseiten mit nur einem Klick. Ob fremdsprachige Informationen, technische Dokumentationen oder mehrsprachige E-Commerce-Seiten – das Plugin optimiert die Übersetzung automatisch basierend auf dem Seiteninhalt und Ihren Bedürfnissen und unterstützt einen zweisprachigen Modus, der Ihnen hilft, Informationen schnell zu erfassen.",
        "web.h2": "Übersetzen Sie die Inhalte großer Websites mit einem Klick",
        "web.button": "Jetzt starten",
        "subtitle.p": "Nutzen Sie das mTranslator-Browser-Plugin, um Videos mit Echtzeit-Untertitelübersetzung zu schauen. Ob zum Lernen, zur Unterhaltung oder für internationale Kommunikation – Sprachbarrieren überwinden war noch nie so einfach.",
        "subtitle.button": "Kostenlos testen",
        "input.p": "Kein App-Wechsel, keine zusätzlichen Schritte – machen Sie Übersetzung zu einem Teil der Eingabe. Geben Sie einfach Text in ein Web-Eingabefeld oder einen Instant-Chat ein und drücken Sie dreimal hintereinander die Leertaste, um den Inhalt schnell in die Zielsprache zu übersetzen.",
        "text.p": "mTranslator bietet Ihnen präzise, kontextoptimierte Textübersetzungsdienste. Ob wissenschaftliche Arbeiten, Geschäftsdokumente oder Gespräche – mLLM wählt das am besten geeignete Sprachmodell basierend auf Textart und Kontext aus, um Genauigkeit und Flüssigkeit der Übersetzung sicherzustellen.",
        "text.button": "Jetzt starten",
        "tool.screenshot.title": "Screenshot-Übersetzung",
        "tool.screenshot.p": "Wählen Sie das am besten geeignete Sprachmodell, um genaue und flüssige Übersetzungsergebnisse zu gewährleisten.",
        "tool.pdf.title": "PDF-Übersetzung",
        "tool.pdf.p": "Für textbasierte PDF-Dokumente (wie Berichte oder wissenschaftliche Arbeiten) kann mTranslator den Text präzise extrahieren und übersetzen.",
        "tool.docx.title": "DOCX-Übersetzung",
        "tool.docx.p": "Übersetzen Sie ganze Dokumente auf einmal, ohne manuelles Kopieren und Einfügen – ideal für lange Artikel, Berichte oder Bücher.",
        "tool.epub.title": "EPUB-Übersetzung",
        "tool.epub.p": "Effiziente Übersetzung, die die Verbreitung digitaler Publikationen über Sprachgrenzen hinweg erleichtert und weltweit ein besseres Leseerlebnis bietet.",
        "mLLM.intro1": "mLLM (Multi-Source Language Learning Model) ist eine intelligente Übersetzungsmaschine, entwickelt vom mTranslator-Team.",
        "mLLM.intro2": "Es kombiniert mehrere führende KI-Übersetzungsmodelle und wählt dynamisch das leistungsstärkste basierend auf Sprache, Texttyp und Nutzungsszenario. Das System bewertet kontinuierlich die Qualität, das Verständnis und die Anpassungsfähigkeit der Modelle.",
        "mLLM.intro3": "Da sich KI-Technologien schnell weiterentwickeln, ändern sich Modelle und ihre Leistung regelmäßig. mLLM verfolgt die neuesten Entwicklungen in Echtzeit und optimiert die Modellauswahl, sodass Nutzer stets die beste Übersetzung erhalten, ohne manuell umschalten zu müssen.",
        "privacy.title": "Datenschutzerklärung",
        "privacy.p1": "Das mTranslator-Team nimmt den Datenschutz und die Datensicherheit der Nutzer sehr ernst.",
        "privacy.p2": "Im Rahmen unserer Übersetzungsdienste nutzen wir Übersetzungsdaten, um die Leistung des mLLM-Engines zu optimieren und die Anonymität zu wahren.",
        "privacy.p3": "Wir werden jedoch niemals persönliche Daten aufzeichnen, speichern oder analysieren, die Ihre Identität preisgeben.",
        "privacy.p4": "Ihre persönlichen Daten sind stets sicher und geschützt, und wir versprechen, sie nicht für andere Zwecke zu verwenden oder an Dritte weiterzugeben. ",
        "privacy.p5": "Unsere Datenschutzmaßnahmen gewährleisten, dass Ihre Daten unter allen Umständen streng geschützt sind.",
        "footer.terms": "Allgemeine Geschäftsbedingungen",
        "footer.privacy": "Datenschutzrichtlinie",
        "ul_title1": "Unterstützt über 30 Sprachen weltweit, kontinuierlich erweiternd：",
        "ul_title2": "Intelligentes Verständnis, präzise und flüssig：",
        "ul_title3": "KI-optimierte Engine, die stets die beste Übersetzung liefert：",
        "li_text1": "Die mLLM-Übersetzungsengine wird kontinuierlich weiterentwickelt und optimiert, aktualisiert in Echtzeit die Sprachunterstützung und erleichtert so eine flüssigere Kommunikation zwischen den Sprachen.",
        "li_text2": "Sie beschränkt sich nicht auf eine Satz-für-Satz-Übersetzung; mTranslator nutzt eine vollständige Textanalyse und Kontextverständnis, um Übersetzungen zu erstellen, die natürlicher klingen und den Ausdrucksgewohnheiten der Muttersprache entsprechen.",
        "li_text3": "Durch die kontinuierliche Überwachung der KI-Übersetzungsleistung und die intelligente Auswahl des optimalen Modells optimiert das System dynamisch die Übersetzungsqualität in allen Sprachen und gewährleistet stets präzise und herausragende Ergebnisse.",
        "disclaimer_title": "Haftungsausschluss:",
        "disclaimer_NASA": "Die auf dieser Seite gezeigten Screenshots der NASA-Website dienen ausschließlich der Demonstration der Übersetzungsfunktion. Diese Website steht in keiner Verbindung zu oder ist in Zusammenarbeit mit der NASA.",
        "title404": "Seite nicht gefunden",
        "message404": "Entschuldigung, wir konnten die von Ihnen angeforderte Seite nicht finden.",
        "button404": "Zur Startseite"
    },
    "es": {
        "head.title": "mTranslator: traducción inteligente impulsada por IA",
        "meta.description": "mTranslator usa LLMs avanzados para traducir con un clic páginas web, subtítulos, entradas y documentos. Su IA contextual entrega traducciones precisas y naturales para comunicación global.",
        "twitter.image.alt": "logotipo de mTranslator en blanco sobre un fondo degradado de púrpura a rosa",
        "nav.pricing": "Precios",
        "nav.download": "Descargar",
        "nav.resource": "Recursos",
        "register": "Iniciar sesión",
        "banner.slogan": "The World, YOUR WORDS",
        "banner.text": "traducción inteligente impulsada por IA <br> que permite traducir páginas web,  subtítulos, <br>texto ingresado y textos.",
        "banner.button": "Prueba gratis",
        "web.p": "Instala el complemento de navegador mTranslator y traduce páginas web completas con un solo clic. Ya sean noticias en idiomas extranjeros, documentación técnica o páginas de comercio electrónico multilingüe, el complemento optimiza automáticamente la traducción según el contenido de la página y tus necesidades, y soporta un modo bilingüe para ayudarte a captar la información rápidamente.",
        "web.h2": "Traduce el contenido de los principales sitios web con un clic",
        "web.button": "Empezar",
        "subtitle.p": "Utiliza el complemento de navegador mTranslator para ver videos con traducción de subtítulos en tiempo real. Ya sea para aprender, entretenerte o comunicarte internacionalmente, superar las barreras del idioma nunca fue tan fácil.",
        "subtitle.button": "Prueba gratis",
        "input.p": "No necesitas cambiar de aplicación ni realizar pasos adicionales. Simplemente ingresa el texto en un cuadro de entrada web o en un chat instantáneo, y presiona la barra espaciadora tres veces seguidas para traducir rápidamente el contenido al idioma deseado.",
        "text.p": "mTranslator te ofrece servicios de traducción de texto precisos y optimizados según el contexto. Ya sea un artículo académico, un documento comercial o una conversación, mLLM selecciona el modelo lingüístico más adecuado según el tipo de texto y el contexto para garantizar la precisión y fluidez de la traducción.",
        "text.button": "Empezar",
        "tool.screenshot.title": "Traducción de Capturas",
        "tool.screenshot.p": "Selecciona el modelo lingüístico más adecuado para garantizar resultados de traducción precisos y fluidos.",
        "tool.pdf.title": "Traducción de PDF",
        "tool.pdf.p": "Para documentos PDF basados en texto (como informes o artículos académicos), mTranslator puede extraer y traducir el texto con precisión.",
        "tool.docx.title": "Traducción de DOCX",
        "tool.docx.p": "Traduce documentos completos de una sola vez sin necesidad de copiar y pegar, ahorrándote tiempo, especialmente para artículos largos, informes o libros.",
        "tool.epub.title": "Traducción de EPUB",
        "tool.epub.p": "Traducción eficiente que facilita la difusión de publicaciones digitales en varios idiomas, ofreciendo una mejor experiencia de lectura a usuarios de todo el mundo.",
        "mLLM.intro1": "mLLM (Modelo de Aprendizaje de Idiomas de Múltiples Fuentes) es un motor de traducción inteligente desarrollado por el equipo de mTranslator.",
        "mLLM.intro2": "Agrega varios modelos de traducción de IA líderes y selecciona dinámicamente el mejor según el idioma, tipo de texto y contexto de uso. El sistema evalúa continuamente la comprensión, la calidad de la traducción y la adaptabilidad de los modelos.",
        "mLLM.intro3": "Dado el rápido avance de la IA, los modelos se actualizan con frecuencia y su rendimiento varía. mLLM rastrea los últimos desarrollos en tiempo real, optimizando la selección de modelos para que los usuarios obtengan la mejor traducción sin necesidad de cambiar manualmente los motores.",
        "privacy.p1": "El equipo de mTranslator se toma muy en serio la privacidad y seguridad de los datos de los usuarios.",
        "privacy.p2": "Durante la prestación de nuestros servicios de traducción, usamos los datos para mejorar el rendimiento del motor mLLM, garantizando siempre el anonimato.",
        "privacy.p3": "Sin embargo, nunca registraremos, almacenaremos ni analizaremos datos personales que puedan identificarte.",
        "privacy.p4": "Tu información personal siempre estará segura y protegida, y prometemos no usarla para otros fines ni compartirla con terceros. ",
        "privacy.p5": "Nuestras medidas de privacidad aseguran que tus datos estén estrictamente protegidos en todo momento.",
        "footer.terms": "Términos y Condiciones",
        "footer.privacy": "Política de Privacidad",
        "ul_title1": "Soporta más de 30 idiomas en todo el mundo, en continua expansión：",
        "ul_title2": "Comprensión inteligente, precisa y fluida：",
        "ul_title3": "Motor de IA optimizado, siempre ofreciendo la mejor traducción：",
        "li_text1": "El motor de traducción mLLM se itera y optimiza continuamente, actualizando el soporte de idiomas en tiempo real para facilitar una comunicación más fluida entre diferentes lenguas.",
        "li_text2": "No se limita a traducir frase por frase; mTranslator utiliza análisis de texto completo y comprensión contextual para generar traducciones que suenan más naturales y se ajustan a los hábitos de expresión nativos.",
        "li_text3": "Mediante la monitorización en tiempo real del rendimiento de la traducción AI y la selección inteligente del modelo óptimo, se optimiza dinámicamente la calidad de la traducción en todos los idiomas, garantizando resultados siempre precisos y excepcionales.",
        "disclaimer_title": "Descargo de responsabilidad:",
        "disclaimer_NASA": "Las capturas de pantalla del sitio web de la NASA que se muestran en esta página se utilizan únicamente para demostrar la función de traducción. Este sitio web no tiene ninguna colaboración ni afiliación con la NASA.",
        "title404": "Página no encontrada",
        "message404": "Lo sentimos, no podemos encontrar la página que buscas.",
        "button404": "Volver al inicio"
    },
    "fr": {
        "head.title": "mTranslator: traduction intelligente propulsée par l'IA",
        "meta.description": "mTranslator utilise des LLM avancés pour traduire en un clic les pages web, sous‑titres, champs de saisie et documents. Son IA contextuelle assure des résultats précis et naturels pour une communication mondiale.",
        "twitter.image.alt": "logo mTranslator en blanc sur un fond dégradé du violet au rose",
        "nav.pricing": "Tarification",
        "nav.download": "Télécharger",
        "nav.resource": "Ressources",
        "register": "Se connecter",
        "banner.slogan": "The World, YOUR WORDS",
        "banner.text": "traduction intelligente propulsée par l'IA <br> supportant la traduction de pages web, <br> de sous-titres, de saisies et de textes.",
        "banner.button": "Essai gratuit",
        "web.p": "Installez l'extension mTranslator pour votre navigateur et traduisez des pages web entières en un clic. Qu'il s'agisse d'informations en langues étrangères, de documentations techniques ou de pages e-commerce multilingues, le plugin optimise automatiquement la traduction en fonction du contenu de la page et de vos besoins, et propose un mode bilingue pour vous aider à saisir rapidement l'information.",
        "web.h2": "Traduisez le contenu des grands sites web en un clic",
        "web.button": "Commencer",
        "subtitle.p": "Utilisez le plugin mTranslator pour regarder des vidéos avec des sous-titres traduits en temps réel. Que ce soit pour apprendre, se divertir ou communiquer à l'international, lever les barrières linguistiques n'a jamais été aussi simple.",
        "subtitle.button": "Essai gratuit",
        "input.p": "Pas besoin de changer d'application ni de faire des étapes supplémentaires. Saisissez simplement le texte dans un champ de saisie web ou dans un chat instantané, puis appuyez trois fois sur la barre d'espace pour traduire rapidement le contenu dans la langue cible.",
        "text.p": "mTranslator vous offre des services de traduction de texte précis et optimisés selon le contexte. Qu'il s'agisse d'un article académique, d'un document professionnel ou d'une conversation, mLLM sélectionne le modèle linguistique le plus adapté en fonction du type de texte et du contexte pour garantir la précision et la fluidité de la traduction.",
        "text.button": "Commencer",
        "tool.screenshot.title": "Traduction d'Écran",
        "tool.screenshot.p": "Sélectionnez le modèle linguistique le plus adapté pour garantir des résultats de traduction précis et fluides.",
        "tool.pdf.title": "Traduction de PDF",
        "tool.pdf.p": "Pour les documents PDF contenant du texte (comme les rapports ou articles académiques), mTranslator peut extraire et traduire le texte avec précision.",
        "tool.docx.title": "Traduction de DOCX",
        "tool.docx.p": "Traduisez des documents entiers en une seule fois sans copier-coller manuellement, ce qui vous fait gagner du temps, notamment pour les articles longs, rapports ou livres.",
        "tool.epub.title": "Traduction d'EPUB",
        "tool.epub.p": "Une traduction efficace qui facilite la diffusion des publications numériques à travers les langues, offrant une meilleure expérience de lecture aux utilisateurs du monde entier.",
        "mLLM.intro1": "mLLM (Modèle d'Apprentissage Linguistique Multi-Sources) est un moteur de traduction intelligent développé par l'équipe de mTranslator.",
        "mLLM.intro2": "Il agrège plusieurs modèles d'IA de premier plan et sélectionne dynamiquement le plus performant en fonction de la langue, du type de texte et du contexte d'utilisation. Le système évalue en continu la compréhension, la qualité et l'adaptabilité des modèles.",
        "mLLM.intro3": "Avec l'évolution rapide de l'IA, les modèles sont régulièrement mis à jour et leurs performances varient. mLLM suit les dernières avancées en temps réel et optimise la sélection des modèles pour offrir aux utilisateurs la meilleure expérience de traduction sans avoir à changer de moteur manuellement.",
        "privacy.title": "Déclaration de Confidentialité",
        "privacy.p1": "L'équipe mTranslator prend très au sérieux la confidentialité et la sécurité des données des utilisateurs.",
        "privacy.p2": "Dans le cadre de nos services de traduction, nous pouvons utiliser les données pour améliorer les performances du moteur mLLM tout en préservant l'anonymat.",
        "privacy.p3": "Cependant, nous ne collecterons, stockerons ou analyserons jamais de données personnelles permettant de vous identifier.",
        "privacy.p4": "Vos informations personnelles sont toujours sécurisées et protégées, et nous nous engageons à ne pas les utiliser à d'autres fins ni à les partager avec des tiers. ",
        "privacy.p5": "Nos mesures de confidentialité garantissent que vos données sont strictement protégées en toutes circonstances.",
        "footer.terms": "Conditions Générales",
        "footer.privacy": "Politique de Confidentialité",
        "ul_title1": "Prend en charge plus de 30 langues dans le monde, en expansion continue：",
        "ul_title2": "Compréhension intelligente, précise et fluide：",
        "ul_title3": "Moteur IA optimisé, toujours offrant la meilleure traduction：",
        "li_text1": "Le moteur de traduction mLLM est continuellement itéré et optimisé, mettant à jour le support linguistique en temps réel pour faciliter une communication plus fluide entre les langues.",
        "li_text2": "Il ne se limite pas à une traduction phrase par phrase ; mTranslator utilise une analyse textuelle complète et une compréhension contextuelle pour générer des traductions qui sonnent plus naturelles et s'alignent avec les habitudes d'expression natives.",
        "li_text3": "En surveillant en temps réel les performances de traduction de l'IA et en sélectionnant intelligemment le modèle optimal, il optimise dynamiquement la qualité des traductions dans toutes les langues, garantissant des résultats toujours précis et exceptionnels.",
        "disclaimer_title": "Avertissement :",
        "disclaimer_NASA": "Les captures d'écran du site web de la NASA présentées sur cette page sont uniquement utilisées à des fins de démonstration de la fonction de traduction. Ce site n'a aucun partenariat ni lien avec la NASA.",
        "title404": "Page non trouvée",
        "message404": "Désolé, nous ne pouvons pas trouver la page que vous recherchez.",
        "button404": "Retour à l'accueil"
    },
    "it": {
        "head.title": "mTranslator: traduzione intelligente guidata dall'IA",
        "meta.description": "mTranslator sfrutta LLM avanzati per tradurre con un clic pagine web, sottotitoli, input e documenti. La sua IA contestuale garantisce risultati precisi e naturali per una comunicazione globale.",
        "twitter.image.alt": "logo di mTranslator in bianco su uno sfondo sfumato dal viola al rosa",
        "nav.pricing": "Prezzi",
        "nav.download": "Scarica",
        "nav.resource": "Risorse",
        "register": "Accedi",
        "banner.slogan": "The World, YOUR WORDS",
        "banner.text": "traduzione intelligente guidata dall'IA <br> che supporta la traduzione di pagine web, <br> sottotitoli, input e testi.",
        "banner.button": "Prova Gratis",
        "web.p": "Installa l'addon per browser mTranslator e traduci intere pagine web con un solo clic. Che si tratti di informazioni in lingua straniera, documentazione tecnica o pagine di e-commerce multilingue, il plugin ottimizza automaticamente la traduzione in base al contenuto della pagina e alle tue esigenze, supportando una modalità bilingue per aiutarti a cogliere rapidamente le informazioni.",
        "web.h2": "Traduci il contenuto dei principali siti web con un clic",
        "web.button": "Inizia Ora",
        "subtitle.p": "Utilizza il plugin per browser mTranslator per guardare video con sottotitoli tradotti in tempo reale. Che sia per studio, intrattenimento o comunicazione internazionale, superare le barriere linguistiche non è mai stato così semplice.",
        "subtitle.button": "Prova Gratis",
        "input.p": "Non è necessario cambiare app o eseguire passaggi aggiuntivi. Basta inserire il testo in un campo di input web o in una chat istantanea, e premere tre volte consecutive la barra spaziatrice per tradurre rapidamente il contenuto nella lingua desiderata.",
        "text.p": "mTranslator ti offre servizi di traduzione testuale precisi e ottimizzati in base al contesto. Che si tratti di un articolo accademico, un documento aziendale o una conversazione, mLLM seleziona il modello linguistico più adatto in base al tipo di testo e al contesto per garantire la precisione e la fluidità della traduzione.",
        "text.button": "Inizia Ora",
        "tool.screenshot.title": "Traduzione Screenshot",
        "tool.screenshot.p": "Seleziona il modello linguistico più adatto per garantire risultati di traduzione accurati e fluidi.",
        "tool.pdf.title": "Traduzione PDF",
        "tool.pdf.p": "Per documenti PDF basati su testo (come report o articoli accademici), mTranslator può estrarre e tradurre il testo con precisione.",
        "tool.docx.title": "Traduzione DOCX",
        "tool.docx.p": "Traduci interi documenti in una volta senza dover copiare e incollare manualmente, risparmiando tempo, specialmente per articoli lunghi, report o libri.",
        "tool.epub.title": "Traduzione EPUB",
        "tool.epub.p": "Traduzione efficiente che rende più semplice la diffusione di pubblicazioni digitali in diverse lingue, offrendo una migliore esperienza di lettura agli utenti di tutto il mondo.",
        "mLLM.intro1": "mLLM (Modello di Apprendimento Linguistico Multi-Sorgente) è un motore di traduzione intelligente sviluppato dal team di mTranslator.",
        "mLLM.intro2": "Aggrega diversi modelli AI di traduzione e seleziona dinamicamente il migliore in base alla lingua, al tipo di testo e al contesto d'uso. Il sistema valuta continuamente la comprensione, la qualità e l'adattabilità dei modelli.",
        "mLLM.intro3": "Con l'evoluzione rapida dell'IA, i modelli vengono aggiornati frequentemente e il loro rendimento cambia. mLLM monitora gli ultimi progressi in tempo reale, ottimizzando la selezione per garantire la migliore esperienza di traduzione senza necessità di cambiare manualmente il motore.",
        "privacy.title": "Informativa sulla Privacy",
        "privacy.p1": "Il team di mTranslator prende molto sul serio la privacy e la sicurezza dei dati degli utenti.",
        "privacy.p2": "Durante la fornitura dei servizi di traduzione, potremmo utilizzare i dati di traduzione per ottimizzare le prestazioni del motore mLLM, garantendo l'anonimato.",
        "privacy.p3": "Tuttavia, non registreremo, memorizzeremo o analizzeremo dati personali che possano identificarti.",
        "privacy.p4": "Le tue informazioni personali sono sempre sicure e protette, e ci impegniamo a non usarle per altri scopi o a condividerle con terze parti. ",
        "privacy.p5": "Le nostre misure di privacy assicurano che i tuoi dati siano rigorosamente tutelati in ogni circostanza.",
        "footer.terms": "Termini e Condizioni",
        "footer.privacy": "Informativa sulla Privacy",
        "ul_title1": "Supporta oltre 30 lingue in tutto il mondo, in continua espansione：",
        "ul_title2": "Comprensione intelligente, traduzione precisa e fluida：",
        "ul_title3": "Motore AI ottimizzato, sempre in grado di offrire la migliore traduzione：",
        "li_text1": "Il motore di traduzione mLLM viene costantemente aggiornato e ottimizzato, aggiornando in tempo reale il supporto linguistico per facilitare una comunicazione più fluida tra le lingue.",
        "li_text2": "Non si limita a tradurre frase per frase; mTranslator utilizza l'analisi del testo completo e la comprensione del contesto per generare traduzioni che suonano più naturali e si adattano alle abitudini espressive dei madrelingua.",
        "li_text3": "Monitorando in tempo reale le prestazioni della traduzione AI e selezionando in modo intelligente il modello ottimale, il sistema ottimizza dinamicamente la qualità delle traduzioni in tutte le lingue, garantendo risultati sempre precisi ed eccezionali.",
        "disclaimer_title": "Disclaimer:",
        "disclaimer_NASA": "Gli screenshot del sito NASA mostrati in questa pagina sono utilizzati esclusivamente per dimostrare la funzionalità di traduzione. Questo sito non è affiliato né in collaborazione con la NASA.",
        "title404": "Pagina non trovata",
        "message404": "Ci dispiace, non riusciamo a trovare la pagina che stai cercando.",
        "button404": "Torna alla Home"
    },
    "ja": {
        "head.title": "mTranslator: AI駆動のインテリジェント翻訳",
        "meta.description": "mTranslatorは先進的なLLMでワンクリック翻訳：ウェブページ、字幕、入力、ドキュメントに対応。文脈対応AIが正確かつ自然な結果を提供し、グローバルなコミュニケーションを支援します。",
        "twitter.image.alt": "紫からピンクのグラデーション背景に白いmTranslatorロゴ",
        "nav.pricing": "料金",
        "nav.download": "ダウンロード",
        "nav.resource": "リソース",
        "register": "サインイン",
        "banner.slogan": "言の葉の戸開き",
        "banner.text": "AI駆動のインテリジェント翻訳<br>ウェブページ翻訳、字幕翻訳、入力翻訳、テキスト翻訳に対応",
        "banner.button": "無料で試す",
        "web.p": "mTranslatorブラウザ拡張機能をインストールすれば、ワンクリックでウェブページ全体を翻訳できます。外国語の情報、技術文書、または多言語のECサイトなど、ページの内容とユーザーのニーズに応じて翻訳効果を自動で最適化し、バイリンガルモードで情報を迅速に把握できます。",
        "web.h2": "主要サイトの内容をワンクリックで翻訳",
        "web.button": "今すぐ始める",
        "subtitle.p": "mTranslatorブラウザ拡張機能を使えば、動画視聴中にリアルタイムで字幕翻訳が可能です。学習、エンターテイメント、国際コミュニケーションなど、言語の壁を簡単に乗り越えられます。",
        "subtitle.button": "無料で試す",
        "input.p": "アプリを切り替える必要はなく、余計な手間もかかりません。ウェブの入力欄やインスタントチャットにテキストを入力し、スペースキーを3回連続で押すだけで、素早く内容を希望の言語に翻訳します。",
        "text.p": "mTranslatorは、正確で文脈に最適化されたテキスト翻訳サービスを提供します。学術論文、ビジネス文書、または会話など、テキストの種類や文脈に応じて最適な言語モデルを選び、翻訳の正確さと流暢さを保証します。",
        "text.button": "今すぐ始める",
        "tool.screenshot.title": "スクリーンショット翻訳",
        "tool.screenshot.p": "スクリーンショットに含まれるテキストを高精度に認識し、選択した最適な言語モデルでスムーズに翻訳します。手間なく画像内の情報を理解し、多言語間のコミュニケーションをより簡単にします。",
        "tool.pdf.title": "PDF翻訳",
        "tool.pdf.p": "レポートや学術論文などのPDF文書からテキストを正確に抽出し、違和感のない自然な翻訳を提供します。専門的な内容も的確に伝わるよう、質の高い翻訳結果を実現します。",
        "tool.docx.title": "DOCX翻訳",
        "tool.docx.p": "コピー＆ペーストの手間をかけずに、文書全体を一括翻訳。特に長文のレポートや書籍など、大量のテキストを扱う場合に最適で、作業効率を大幅に向上させます。",
        "tool.epub.title": "EPUB翻訳",
        "tool.epub.p": "電子書籍の内容をスムーズに翻訳し、多言語対応の快適な読書体験を提供します。外国語の本でも言語の壁を感じることなく、どこでも気軽に楽しめます。",
        "mLLM.intro1": "mLLM（マルチソース言語学習モデル）は、mTranslatorチームが開発したAI翻訳エンジンです。",
        "mLLM.intro2": "複数の主要なAI翻訳モデルを統合し、言語、テキストの種類、使用状況に応じて最適なモデルを動的に選択します。システムは翻訳品質、理解力、適応性を継続的に評価します。",
        "mLLM.intro3": "AI技術は急速に進化し、モデルの性能も変化します。mLLMは最新の進展をリアルタイムで追跡し、最適なモデルを選択することで、手動での切り替えなしに最高の翻訳体験を提供します。",
        "privacy.title": "プライバシー声明",
        "privacy.p1": "mTranslatorチームはユーザーのプライバシーとデータセキュリティを非常に重視しています。",
        "privacy.p2": "翻訳サービスの提供過程で、mLLM翻訳エンジンの性能向上のため、翻訳データを匿名化した上で使用することがあります。",
        "privacy.p3": "しかし、個人を特定できるプライベートなデータは一切記録、保存、解析しません。",
        "privacy.p4": "お客様の個人情報は常に安全に保護され、他の目的で使用したり第三者と共有したりすることはありません。",
        "privacy.p5": "私たちのプライバシー保護対策は、いかなる状況下でもデータの厳重な保護を保証します。",
        "footer.terms": "利用規約",
        "footer.privacy": "プライバシーポリシー",
        "ul_title1": "世界30以上の言語に対応、継続的に拡大中：",
        "ul_title2": "高度な理解、正確かつ滑らか：",
        "ul_title3": "AI最適化エンジン、常に最良の翻訳を提供：",
        "li_text1": "mLLM翻訳エンジンは常に技術革新を重ねながら改善と最適化を続け、最新の言語対応をリアルタイムで反映することで、多様な言語間のコミュニケーションをさらにスムーズかつ効率的に実現し、ユーザーに快適な国際交流環境を提供します。",
        "li_text2": "mTranslatorは文単位の単純な翻訳に限定せず、文章全体の構造や文脈を細かく解析する技術を活用し、より自然でネイティブらしい表現を実現する高品質な翻訳結果を生み出し、ユーザーの理解と情報伝達を大幅に向上させます。",
        "li_text3": "AIの翻訳性能をリアルタイムで細かく監視し、最適な翻訳モデルを自動で選定する仕組みにより、各言語間の翻訳品質を常に動的に最適化し、正確で卓越した翻訳結果が提供されることを保証し、安心して利用できる環境を整えています。",
        "disclaimer_title": "免責事項：",
        "disclaimer_NASA": "このページに表示されるNASAのウェブサイトのスクリーンショットは、翻訳機能のデモンストレーション目的のみで使用中です。当サイトはNASAとは一切関係がありません。",
        "title404": "ページが見つかりません",
        "message404": "申し訳ありませんが、お探しのページは見つかりませんでした。",
        "button404": "ホームに戻る"
    },
    "ko": {
        "head.title": "mTranslator: AI 기반 지능형 번역",
        "meta.description": "mTranslator는 첨단 LLM으로 웹페이지·자막·입력·문서를 원클릭 번역합니다. 문맥 인식 AI가 정확하고 자연스러운 결과를 제공해 글로벌 소통을 지원합니다.",
        "twitter.image.alt": "보라색에서 분홍색 그라데이션 배경 위의 흰색 mTranslator 로고",
        "nav.pricing": "가격",
        "nav.download": "다운로드",
        "nav.resource": "리소스",
        "register": "로그인",
        "banner.slogan": "The World, YOUR WORDS",
        "banner.text": "AI 기반 지능형 번역 <br> 웹페이지 번역, 자막 번역, 입력 번역, 텍스트 번역을 지원합니다.",
        "banner.button": "무료 체험",
        "web.p": "mTranslator 브라우저 확장 프로그램을 설치하면 한 번의 클릭으로 전체 웹페이지를 번역할 수 있습니다. 외국어 정보, 기술 문서, 다국어 전자상거래 페이지 등, 웹페이지의 내용과 사용자의 필요에 따라 번역 효과를 자동으로 최적화하며, 이중 언어 모드를 지원하여 정보를 빠르게 파악할 수 있도록 도와줍니다.",
        "web.h2": "주요 웹사이트 내용을 한 번의 클릭으로 번역",
        "web.button": "시작하기",
        "subtitle.p": "mTranslator 브라우저 확장 프로그램을 사용하여 동영상을 실시간 자막 번역과 함께 시청하세요. 학습, 엔터테인먼트, 국제 소통 등 언어 장벽을 쉽게 극복할 수 있습니다.",
        "subtitle.button": "무료 체험",
        "input.p": "앱 전환이나 추가 단계 없이, 웹 입력창이나 인스턴트 채팅에 텍스트를 입력한 후, 스페이스바를 세 번 연속 누르기만 하면 원하는 언어로 빠르게 번역할 수 있습니다.",
        "text.p": "mTranslator는 정확하고 문맥에 최적화된 텍스트 번역 서비스를 제공합니다. 학술 논문, 비즈니스 문서, 대화 등 텍스트 유형과 문맥에 따라 가장 적합한 언어 모델을 선택하여 번역의 정확성과 유창함을 보장합니다.",
        "text.button": "시작하기",
        "tool.screenshot.title": "스크린샷 번역",
        "tool.screenshot.p": "스크린샷 속 텍스트를 자동으로 감지하고, 최적의 언어 모델을 활용하여 빠르고 정확하게 번역합니다. 이미지 속 내용을 손쉽게 이해할 수 있어, 다국어 소통이 더욱 편리해집니다.",
        "tool.pdf.title": "PDF 번역",
        "tool.pdf.p": "보고서, 학술 논문 등 텍스트가 포함된 PDF 문서에서 필요한 정보를 정밀하게 추출하여 자연스럽고 일관성 있는 번역 결과를 제공합니다. 전문적인 문서도 고품질 번역을 통해 더욱 쉽게 이해할 수 있습니다.",
        "tool.docx.title": "DOCX 번역",
        "tool.docx.p": "문서를 일일이 복사해서 붙여넣을 필요 없이, 한 번의 작업으로 전체 내용을 번역할 수 있습니다. 긴 문서, 연구 보고서, 서적 등 대량 텍스트 번역이 필요한 경우 특히 유용합니다.",
        "tool.epub.title": "EPUB 번역",
        "tool.epub.p": "전자책을 쉽고 빠르게 번역하여, 세계 어디에서나 다양한 언어로 편리하게 독서를 즐길 수 있습니다. 원서 읽기 부담을 줄이고, 보다 몰입감 있는 독서 경험을 제공합니다.",
        "mLLM.intro1": "mLLM(다중 소스 언어 학습 모델)은 mTranslator 팀이 개발한 지능형 번역 엔진입니다.",
        "mLLM.intro2": "다양한 AI 번역 모델을 통합하여 언어, 텍스트 유형, 사용 환경에 따라 최적의 모델을 동적으로 선택합니다. 시스템은 번역 품질, 이해력, 적응성을 지속적으로 평가합니다.",
        "mLLM.intro3": "AI 기술이 빠르게 발전하면서 모델의 성능도 변합니다. mLLM은 최신 동향을 실시간으로 추적하여 최적의 모델을 선택함으로써 사용자가 엔진을 직접 변경하지 않아도 최고의 번역 경험을 제공합니다.",
        "privacy.title": "개인정보 보호정책",
        "privacy.p1": "mTranslator 팀은 사용자 개인정보와 데이터 보안을 매우 중요하게 생각합니다.",
        "privacy.p2": "번역 서비스를 제공하는 과정에서, 익명성을 보장하면서 번역 데이터를 mLLM 엔진의 성능 최적화를 위해 사용할 수 있습니다.",
        "privacy.p3": "그러나, 사용자를 식별할 수 있는 개인 데이터를 기록, 저장 또는 분석하지 않습니다.",
        "privacy.p4": "사용자의 개인정보는 항상 안전하게 보호되며, 다른 용도로 사용하거나 제3자와 공유하지 않을 것을 약속합니다. ",
        "privacy.p5": "우리의 개인정보 보호 조치는 모든 상황에서 데이터를 철저히 보호합니다.",
        "footer.terms": "이용 약관",
        "footer.privacy": "개인정보 처리방침",
        "ul_title1": "전 세계 30개 이상의 언어 지원, 지속적으로 확장：",
        "ul_title2": "똑똑한 이해, 정밀하고 유창하게：",
        "ul_title3": "AI 최적 엔진, 항상 최상의 번역 제공：",
        "li_text1": "mLLM 번역 엔진은 끊임없는 기술 개선과 최적화를 통해 최신 언어 지원을 실시간으로 반영하며, 다양한 언어 간 소통이 더욱 원활하고 효율적으로 이루어질 수 있도록 도와 사용자에게 보다 편리한 글로벌 커뮤니케이션 환경을 제공합니다.",
        "li_text2": "mTranslator는 단순히 문장 단위의 번역에 머무르지 않고 전체 텍스트의 구조와 문맥을 심도 있게 분석하는 기술을 활용하여, 보다 자연스럽고 모국어에 충실한 고품질 번역 결과를 만들어내어 사용자에게 향상된 이해도와 전달력을 제공합니다.",
        "li_text3": "실시간으로 AI 번역 성능을 세밀하게 모니터링하고 상황에 맞는 최적의 번역 모델을 지능적으로 선택함으로써, 모든 언어의 번역 품질을 동적으로 개선 및 최적화하여 언제나 정확하고 탁월한 번역 결과가 제공되도록 보장하고 있습니다.",
        "disclaimer_title": "면책 조항:",
        "disclaimer_NASA": "이 페이지에 표시된 NASA 웹사이트 스크린샷은 번역 기능 시연 용도로만 사용되며, 이 사이트는 NASA와 어떠한 협력이나 연관이 없습니다.",
        "title404": "페이지를 찾을 수 없음",
        "message404": "죄송합니다. 찾으시는 페이지를 찾을 수 없습니다.",
        "button404": "홈으로 돌아가기"
    },
    "pt": {
        "head.title": "mTranslator: tradução inteligente impulsionada por IA",
        "meta.description": "mTranslator usa LLMs avançados para traduzir com um clique páginas web, legendas, campos de entrada e documentos. Sua IA contextual garante resultados precisos e naturais para comunicação global.",
        "twitter.image.alt": "logotipo do mTranslator em branco sobre um fundo em gradiente de roxo a rosa",
        "nav.pricing": "Preços",
        "nav.download": "Baixar",
        "nav.resource": "Recursos",
        "register": "Entrar",
        "banner.slogan": "The World, YOUR WORDS",
        "banner.text": "tradução inteligente impulsionada por IA <br> que suporta tradução de páginas web,  <br> legendas, entradas e textos.",
        "banner.button": "Teste grátis",
        "web.p": "Instale o complemento do navegador mTranslator e traduza páginas inteiras com um clique. Seja para informações em línguas estrangeiras, documentação técnica ou páginas de e-commerce multilíngues, o plugin otimiza automaticamente a tradução com base no conteúdo da página e nas suas necessidades, e suporta um modo bilíngue para ajudá-lo a compreender rapidamente as informações.",
        "web.h2": "Traduza o conteúdo dos principais sites com um clique",
        "web.button": "Começar",
        "subtitle.p": "Use o complemento mTranslator para assistir a vídeos com tradução de legendas em tempo real. Seja para aprendizado, entretenimento ou comunicação internacional, superar barreiras linguísticas nunca foi tão fácil.",
        "subtitle.button": "Teste grátis",
        "input.p": "Não é necessário trocar de aplicativo ou realizar etapas extras. Basta digitar o texto em uma caixa de entrada web ou em um chat instantâneo, e pressionar a barra de espaço três vezes seguidas para traduzir rapidamente o conteúdo para o idioma desejado.",
        "text.p": "O mTranslator oferece serviços de tradução de textos precisos e otimizados conforme o contexto. Seja um artigo acadêmico, um documento comercial ou uma conversa, o mLLM seleciona o modelo de linguagem mais adequado com base no tipo de texto e no contexto, garantindo a precisão e a fluidez da tradução.",
        "text.button": "Começar",
        "tool.screenshot.title": "Tradução de Captura de Tela",
        "tool.screenshot.p": "Selecione o modelo de linguagem mais adequado para garantir resultados de tradução precisos e fluidos.",
        "tool.pdf.title": "Tradução de PDF",
        "tool.pdf.p": "Para documentos PDF baseados em texto (como relatórios ou artigos acadêmicos), o mTranslator pode extrair e traduzir o texto com precisão.",
        "tool.docx.title": "Tradução de DOCX",
        "tool.docx.p": "Traduza documentos inteiros de uma vez sem copiar e colar manualmente, economizando tempo, especialmente para artigos longos, relatórios ou livros.",
        "tool.epub.title": "Tradução de EPUB",
        "tool.epub.p": "Tradução eficiente que facilita a disseminação de publicações digitais em diferentes idiomas, proporcionando uma melhor experiência de leitura para usuários em todo o mundo.",
        "mLLM.intro1": "mLLM (Modelo de Aprendizagem Multifuente) é um motor de tradução inteligente desenvolvido pela equipe mTranslator.",
        "mLLM.intro2": "Ele agrega vários modelos de tradução por IA e seleciona dinamicamente o melhor com base no idioma, tipo de texto e cenário de uso. O sistema avalia continuamente a qualidade da tradução, compreensão e adaptabilidade.",
        "mLLM.intro3": "Com a rápida evolução da IA, os modelos são frequentemente atualizados e seu desempenho muda. mLLM acompanha os últimos avanços em tempo real, garantindo a melhor experiência de tradução sem necessidade de troca manual de motores.",
        "privacy.title": "Política de Privacidade",
        "privacy.p1": "A equipe mTranslator leva muito a sério a privacidade e a segurança dos dados dos usuários.",
        "privacy.p2": "Durante a prestação dos serviços de tradução, podemos usar dados de tradução para otimizar o desempenho do motor mLLM, garantindo o anonimato.",
        "privacy.p3": "No entanto, nunca registraremos, armazenaremos ou analisaremos dados pessoais que possam identificá-lo.",
        "privacy.p4": "Suas informações pessoais estão sempre seguras e protegidas, e prometemos não usá-las para outros fins ou compartilhá-las com terceiros. ",
        "privacy.p5": "Nossas medidas de privacidade garantem que seus dados sejam rigorosamente protegidos em todas as circunstâncias.",
        "footer.terms": "Termos e Condições",
        "footer.privacy": "Política de Privacidade",
        "ul_title1": "Suporta mais de 30 idiomas em todo o mundo, com expansão contínua：",
        "ul_title2": "Compreensão inteligente, precisa e fluente：",
        "ul_title3": "Motor de IA otimizado, sempre oferecendo a melhor tradução：",
        "li_text1": "O motor de tradução mLLM é continuamente iterado e otimizado, atualizando o suporte de idiomas em tempo real para facilitar uma comunicação mais fluida entre as línguas.",
        "li_text2": "Não se limita à tradução frase a frase; o mTranslator utiliza análise completa do texto e compreensão contextual para gerar traduções que soam mais naturais e se alinham aos hábitos de expressão nativos.",
        "li_text3": "Ao monitorar o desempenho da tradução da IA em tempo real e selecionar inteligentemente o modelo ideal, otimiza dinamicamente a qualidade das traduções em todos os idiomas, garantindo resultados sempre precisos e excepcionais.",
        "disclaimer_title": "Aviso Legal:",
        "disclaimer_NASA": "As capturas de tela do site da NASA exibidas nesta página são apenas para demonstração da função de tradução. Este site não possui qualquer colaboração ou afiliação com a NASA.",
        "title404": "Página não encontrada",
        "message404": "Desculpe, não conseguimos encontrar a página que você procura.",
        "button404": "Voltar para a página inicial"
    },
    "ru": {
        "head.title": "mTranslator: интеллектуальный перевод на основе ИИ",
        "meta.description": "mTranslator использует передовые LLM для перевода веб‑страниц, субтитров, ввода и документов одним кликом. Контекстная ИИ даёт точные, естественные результаты для глобальной коммуникации.",
        "twitter.image.alt": "логотип mTranslator белого цвета на фоновом градиенте от пурпурного к розовому",
        "nav.pricing": "Цены",
        "nav.download": "Скачать",
        "nav.resource": "Ресурсы",
        "register": "Войти",
        "banner.slogan": "The World, YOUR WORDS",
        "banner.text": "интеллектуальный перевод на основе ИИ <br> поддерживает перевод веб-страниц, <br> субтитров, ввода и текста.",
        "banner.button": "Тест бесплатно",
        "web.p": "Установите браузерное дополнение mTranslator, и вы сможете переводить целые веб-страницы одним кликом. Будь то иностранные новости, техническая документация или многоязычные страницы интернет-магазинов, плагин автоматически оптимизирует перевод на основе содержимого страницы и ваших потребностей, поддерживая режим двух языков для быстрого восприятия информации.",
        "web.h2": "Перевод контента крупных сайтов одним кликом",
        "web.button": "Начать",
        "subtitle.p": "Используйте браузерное дополнение mTranslator для просмотра видео с переводом субтитров в реальном времени. Будь то обучение, развлечения или международное общение — языковые барьеры больше не помеха.",
        "subtitle.button": "Тест бесплатно",
        "input.p": "Нет необходимости переключать приложения или выполнять дополнительные действия. Просто введите текст в веб-поле или чат, затем нажмите клавишу пробела трижды подряд, чтобы быстро перевести содержимое на целевой язык.",
        "text.p": "mTranslator предоставляет точные и оптимизированные с учетом контекста услуги текстового перевода. Будь то научная статья, деловой документ или беседа, mLLM выбирает наиболее подходящую языковую модель, чтобы обеспечить точность и плавность перевода.",
        "text.button": "Начать",
        "tool.screenshot.title": "Перевод скриншотов",
        "tool.screenshot.p": "Выберите наиболее подходящую языковую модель для обеспечения точного и плавного перевода.",
        "tool.pdf.title": "Перевод PDF",
        "tool.pdf.p": "Для PDF-документов с текстом (например, отчётов или научных статей) mTranslator может точно извлечь и перевести текст.",
        "tool.docx.title": "Перевод DOCX",
        "tool.docx.p": "Переводите целые документы сразу, без необходимости копировать и вставлять текст, что экономит время, особенно для длинных статей, отчётов или книг.",
        "tool.epub.title": "Перевод EPUB",
        "tool.epub.p": "Эффективный перевод, обеспечивающий более удобное распространение цифровых публикаций на разных языках и лучший опыт чтения для пользователей по всему миру.",
        "mLLM.intro1": "mLLM (Многоисточниковая языковая модель) — интеллектуальный переводческий движок, разработанный командой mTranslator.",
        "mLLM.intro2": "Он объединяет несколько ведущих моделей ИИ и динамически выбирает оптимальную в зависимости от языка, типа текста и сценария использования. Система постоянно оценивает качество перевода, понимание и адаптивность моделей.",
        "mLLM.intro3": "С развитием ИИ модели регулярно обновляются, и их производительность меняется. mLLM отслеживает последние обновления в реальном времени, выбирая лучшие модели, чтобы пользователи получали качественный перевод без необходимости вручную переключать движки.",
        "privacy.title": "Политика конфиденциальности",
        "privacy.p1": "Команда mTranslator очень серьёзно относится к конфиденциальности и безопасности данных пользователей.",
        "privacy.p2": "При оказании услуг перевода мы можем использовать данные перевода для оптимизации работы движка mLLM с обеспечением анонимности.",
        "privacy.p3": "Однако мы никогда не будем записывать, хранить или анализировать личные данные, которые могут вас идентифицировать.",
        "privacy.p4": "Ваша личная информация всегда в безопасности, и мы обязуемся не использовать её для иных целей или передавать третьим лицам. ",
        "privacy.p5": "Наши меры по защите конфиденциальности гарантируют строгую защиту ваших данных при любых обстоятельствах.",
        "footer.terms": "Условия и положения",
        "footer.privacy": "Политика конфиденциальности",
        "ul_title1": "Поддерживает более 30 языков по всему миру, с непрерывным расширением：",
        "ul_title2": "Интеллектуальное понимание, точность и плавность：",
        "ul_title3": "Оптимизированный ИИ-движок, всегда предоставляющий лучший перевод：",
        "li_text1": "Переводческий движок mLLM постоянно совершенствуется и оптимизируется, обновляя поддержку языков в режиме реального времени для обеспечения более плавного межъязыкового общения.",
        "li_text2": "Он не ограничивается пословным переводом; mTranslator использует анализ полного текста и контекстуальное понимание для создания переводов, которые звучат естественнее и соответствуют языковым привычкам носителей.",
        "li_text3": "Путём непрерывного мониторинга производительности ИИ в переводе и интеллектуального подбора оптимальной модели система динамически оптимизирует качество перевода на всех языках, гарантируя всегда точный и выдающийся результат.",
        "disclaimer_title": "Отказ от ответственности:",
        "disclaimer_NASA": "Скриншоты сайта NASA, представленные на этой странице, используются исключительно для демонстрации функции перевода. Этот сайт не имеет никакого сотрудничества или связи с NASA.",
        "title404": "Страница не найдена",
        "message404": "Извините, мы не можем найти страницу, которую вы ищете.",
        "button404": "Вернуться на главную"
    },
    "zh-Hans": {
        "head.title": "mTranslator: AI驱动的智能翻译",
        "meta.description": "mTranslator 是一款以先进 LLM 为核心技术的智能翻译平台，提供一键网页、字幕、输入和文档翻译服务。通过深度理解上下文与文化语境，实现精准、自然的译文，打破语言壁垒，促进全球无缝沟通。",
        "twitter.image.alt": "白色 mTranslator 徽标，置于紫色到粉红渐变背景上",
        "nav.pricing": "定价",
        "nav.download": "下载",
        "nav.resource": "资源",
        "register": "登录",
        "banner.slogan": "天地万象，方块之间",
        "banner.text": "AI驱动的智能翻译 <br> 支持网页翻译、字幕翻译、输入翻译、文本翻译",
        "banner.button": "免费试用",
        "web.p": "安装mTranslator浏览器插件后，您只需一键即可翻译整个网页。<br>无论是外文资讯、技术文档还是多语言电商页面，插件会根据网页内容和用户需求，自动优化翻译效果，<br>并支持双语对照模式，帮助用户快速掌握信息。",
        "web.h2": "一键翻译各大网站内容",
        "web.button": "立即开始",
        "subtitle.p": "使用mTranslator浏览器插件，观看视频时可实现实时字幕翻译，用户可选择多种语言，轻松跨越语言障碍。<br>无论是学习、娱乐，还是国际交流，mTranslator通过视频上下文识别和字幕优化功能，确保字幕翻译的准确性和同步性。",
        "subtitle.button": "免费试用",
        "input.p": "无需切换应用，无需额外步骤，让翻译成为输入的一部分。<br>只需在网页输入框或即时聊天中输入文字，连续按下三次空格键，即可迅速将内容翻译成目标语言。",
        "text.p": "mTranslator为您提供精准、上下文优化的文本翻译服务。<br>无论是学术论文、商业文书，还是日常对话，mLLM都能根据文本类型与语境，选择最适合的语言模型，确保翻译结果的精确与流畅。",
        "text.button": "立即开始",
        "tool.screenshot.title": "截图翻译",
        "tool.screenshot.p": "智能识别截图中的文字，结合先进的语言模型，实现快速、准确的翻译。无需手动输入，即可轻松获取高质量的翻译结果，让跨语言交流更加顺畅。",
        "tool.pdf.title": "PDF翻译",
        "tool.pdf.p": "支持对包含文本的PDF文档（如研究报告、学术论文等）进行精准提取和翻译，确保内容完整性和专业术语的准确表达，为您的阅读和研究提供更优质的语言支持。",
        "tool.docx.title": "DOCX翻译",
        "tool.docx.p": "无需繁琐的复制粘贴操作，一键翻译整篇文档，特别适用于处理长篇文章、商业报告或书籍等，提高翻译效率的同时，确保翻译内容流畅自然，减少手动调整的工作量。",
        "tool.epub.title": "EPUB翻译",
        "tool.epub.p": "高效翻译电子书内容，让多语言阅读更加便捷。无论是外文小说、技术手册还是学术书籍，都能轻松理解原文内容，为全球用户带来更加自由和顺畅的阅读体验。",
        "mLLM.intro1": "mLLM（多源语言学习模型）是由mTranslator团队研制的智慧翻译引擎。",
        "mLLM.intro2": "mLLM 通过聚合多个主流 AI 翻译模型，并基于各模型在不同语言、文本类型和使用场景下的表现进行动态优选。系统会综合评估各 AI 引擎的理解能力、翻译质量及适应性，自动选择当前评分最高的模型进行翻译。",
        "mLLM.intro3": "AI 技术发展迅速，各大引擎的版本更新迭代频繁，表现也会随之变化。mLLM 能够持续追踪 AI 领域的最新进展，实时优化模型选择，确保用户始终使用最优的翻译方案，而无需手动切换引擎，享受高效、精准的翻译体验。",
        "privacy.title": "隐私声明",
        "privacy.p1": "mTranslator团队高度重视用户隐私与数据安全",
        "privacy.p2": "在提供翻译服务过程中，我们可能在确保匿名的前提下使用翻译数据，以优化mLLM引擎性能。",
        "privacy.p3": "但我们绝不记录、存储或分析任何能识别用户个人信息的数据。",
        "privacy.p4": "用户的个人信息始终安全受保护，我们承诺不将其用于其他用途或分享给第三方。",
        "privacy.p5": "我们的隐私措施确保在任何情况下严格保护用户数据。",
        "footer.terms": "服务条款",
        "footer.privacy": "隐私条款",
        "ul_title1": "支持全球30余种语言，并持续扩展：",
        "ul_title2": "智能理解，精准流畅：",
        "ul_title3": "AI 优选引擎，始终提供最佳翻译：",
        "li_text1": "mLLM 翻译引擎经过不断的迭代优化和技术革新，始终保持着最新的语言支持能力，能够实时更新各种语言资源，从而大幅提升跨语言沟通的流畅性和效率，让不同国家和地区的用户交流无障碍，体验到前所未有的沟通便捷性。",
        "li_text2": "mTranslator 不仅仅局限于逐句翻译，而是通过全面解析整篇文本、深入理解上下文语境及语言细微差别，精心生成既自然流畅又符合母语表达习惯的高质量译文，从而极大提升阅读体验和信息传达效果，为用户带来更精准的语言服务体验。",
        "li_text3": "借助于对 AI 翻译性能的实时监控和数据反馈，mLLM 翻译引擎能够智能匹配当前最优翻译模型，并持续动态优化各语言之间的翻译质量，确保每一次翻译输出都保持精准无误、卓越出众，从而赢得用户的信赖与好评。",
        "disclaimer_title": "免责声明：",
        "disclaimer_NASA": "本页面展示的 NASA 网站截图仅用于翻译功能演示，本网站与 NASA 无任何合作或关联。",
        "title404": "页面未找到",
        "message404": "抱歉，我们找不到你访问的页面。",
        "button404": "返回首页"
    },
    "zh-Hant": {
        "head.title": "mTranslator: AI驅動的智慧翻譯",
        "meta.description": "mTranslator 是一款以先進 LLM 為核心技術的智能翻譯平台，提供一鍵網頁、字幕、輸入和文件翻譯服務。通過深度理解上下文與文化語境，實現精準、自然的譯文，打破語言壁壘，促進全球無縫溝通。",
        "twitter.image.alt": "白色 mTranslator 徽標，置於紫色到粉紅漸變背景上",
        "nav.pricing": "定價",
        "nav.download": "下載",
        "nav.resource": "資源",
        "register": "登入",
        "banner.slogan": "天地萬象，方塊之間",
        "banner.text": "AI驅動的智慧翻譯 <br> 支援網頁翻譯、字幕翻譯、輸入翻譯及文本翻譯",
        "banner.button": "免費試用",
        "web.p": "安裝 mTranslator 瀏覽器外掛後，您只需一鍵即可翻譯整個網頁。<br>無論是外文資訊、技術文件或多語言電商頁面，外掛會根據網頁內容及使用者需求，自動優化翻譯效果，<br>並支援雙語對照模式，幫助使用者迅速掌握資訊。",
        "web.h2": "一鍵翻譯各大網站內容",
        "web.button": "立即開始",
        "subtitle.p": "使用 mTranslator 瀏覽器外掛觀看影片時，可實現即時字幕翻譯，使用者可選擇多種語言，輕鬆跨越語言障礙。",
        "subtitle.button": "免費試用",
        "input.p": "無需切換應用，亦不需額外步驟，讓翻譯成為輸入的一部分。<br>只需在網頁輸入框或即時聊天中輸入文字，連續按下三次空白鍵，即可迅速將內容翻譯成目標語言。",
        "text.p": "mTranslator 為您提供精準、上下文優化的文本翻譯服務。<br>無論是學術論文、商業文書，還是日常對話，mLLM 都能根據文本類型與語境，選擇最適合的語言模型，確保翻譯結果的精確與流暢。",
        "text.button": "立即開始",
        "tool.screenshot.title": "截圖翻譯",
        "tool.screenshot.p": "智能識別截圖中的文字，結合先進的語言模型，實現快速、準確的翻譯。無需手動輸入，即可輕鬆獲取高質量的翻譯結果，讓跨語言交流更加順暢。",
        "tool.pdf.title": "PDF 翻譯",
        "tool.pdf.p": "支援對包含文本的 PDF 文檔（如研究報告、學術論文等）進行精確提取和翻譯，確保內容完整性與專業術語的準確表達，為您的閱讀與研究提供更優質的語言支持。",
        "tool.docx.title": "DOCX 翻譯",
        "tool.docx.p": "無需繁瑣的複製貼上操作，一鍵翻譯整篇文檔，特別適用於處理長篇文章、商業報告或書籍等，提高翻譯效率的同時，確保翻譯內容流暢自然，減少手動調整的工作量。",
        "tool.epub.title": "EPUB 翻譯",
        "tool.epub.p": "高效翻譯電子書內容，讓多語言閱讀更加便捷。無論是外文小說、技術手冊還是學術書籍，都能輕鬆理解原文內容，為全球使用者帶來更加自由與順暢的閱讀體驗。",
        "mLLM.intro1": "mLLM（多源語言學習模型）是由 mTranslator 團隊研製的智慧翻譯引擎。",
        "mLLM.intro2": "它聚合多個主流 AI 翻譯模型，並根據不同語言、文字類型和使用場景動態優選最優模型。系統持續評估各 AI 引擎的理解能力、翻譯品質及適應性，自動選擇評分最高的模型進行翻譯。",
        "mLLM.intro3": "AI 技術發展迅速，各大引擎的版本不斷更新，表現也隨之改變。 mLLM 能夠即時追蹤 AI 領域的最新進展，優化模型選擇，讓使用者無需手動切換引擎，即可享受高效、精準的翻譯體驗",
        "privacy.title": "隱私聲明",
        "privacy.p1": "mTranslator 團隊高度重視使用者隱私及數據安全",
        "privacy.p2": "在提供翻譯服務過程中，我們可能在確保匿名的前提下使用翻譯數據，以優化 mLLM 引擎效能。",
        "privacy.p3": "但我們絕不記錄、儲存或分析任何能識別使用者個人資料的資訊。",
        "privacy.p4": "使用者的個人資訊始終安全受保護，我們承諾不將其用於其他用途或分享給第三方。 ",
        "privacy.p5": "我們的隱私保護措施確保在任何情況下皆能嚴格保護使用者數據。",
        "footer.terms": "服務條款",
        "footer.privacy": "隱私條款",
        "ul_title1": "支持全球30餘種語言，並持續擴展：",
        "ul_title2": "智能理解，精準流暢：",
        "ul_title3": "AI 優選引擎，始終提供最佳翻譯：",
        "li_text1": "mLLM 翻譯引擎經過不斷的迭代優化與技術革新，持續更新各項語言支援，能夠實時調整和補充最新語言資源，從而大幅提升跨語言溝通的流暢性與效率，讓來自不同地區的用戶交流無礙，體驗到前所未有的溝通便捷性。",
        "li_text2": "mTranslator 不僅僅停留在逐句翻譯，而是透過全面解析整篇文章、深入理解語境及語言細節，精心生成既自然流暢又符合母語表達習慣的高品質譯文，從而極大提升了閱讀體驗與資訊傳達效果，為用戶提供更精確的語言服務。",
        "li_text3": "藉由對 AI 翻譯性能的實時監控與數據反饋，mLLM 翻譯引擎能夠智能選擇當前最優翻譯模型，並持續動態地優化各語言間的翻譯品質，確保每次翻譯輸出都維持精準無誤、卓越非凡，從而贏得用戶一致好評。",
        "disclaimer_title": "免責聲明：",
        "disclaimer_NASA": "本頁面展示的 NASA 網站截圖僅用於翻譯功能演示，本網站與 NASA 無任何合作或關聯。",
        "title404": "頁面未找到",
        "message404": "抱歉，我們找不到你訪問的頁面。",
        "button404": "返回首頁"
    }
}
